Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/007.jQuery/007.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-25 Sun 23:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 7: Query</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 7: Query</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7a39ce9">Navigation</a></li>
<li><a href="#org7985c45">Notes</a>
<ul>
<li><a href="#org02b5c61">Section 7.1: Introduction</a></li>
<li><a href="#org555a4f4">Section 7.2: What is jQuery?</a>
<ul>
<li><a href="#orgbc7622b">Section 7.2.1: Finding Elements using CSS-Style Selectors</a></li>
<li><a href="#org4b36b39">Section 7.2.2: Do SOmething with Elements using jQuery Methods</a></li>
<li><a href="#org7a2972a">Section 7.2.3: A jQuery Example</a></li>
</ul>
</li>
<li><a href="#org3448b2f">Section 7.3: Why Use jQuery?</a></li>
</ul>
</li>
<li><a href="#org4ea16c4">Keywords</a></li>
<li><a href="#org581ad45">Questions</a></li>
<li><a href="#org501c267">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7a39ce9" class="outline-2">
<h2 id="org7a39ce9">Navigation</h2>
<div class="outline-text-2" id="text-org7a39ce9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">JavaScript &amp; JQuery - Interactive Front-end Web Development</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 6: Events</td>
<td class="org-left">&vert; <a href="../006.Events/006.000.Notes.html">html</a> &vert; <a href="../006.Events/006.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/006.Events">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 8: AJAX &amp; JSON</td>
<td class="org-left">&vert; <a href="../008.Ajax_and_JSON/008.000.Notes.html">html</a> &vert; <a href="../008.Ajax_and_JSON/008.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/008.Ajax_and_JSON">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7985c45" class="outline-2">
<h2 id="org7985c45">Notes</h2>
<div class="outline-text-2" id="text-org7985c45">
</div>
<div id="outline-container-org02b5c61" class="outline-3">
<h3 id="org02b5c61">Section 7.1: Introduction</h3>
<div class="outline-text-3" id="text-org02b5c61">
<ul class="org-ul">
<li>jQuery offers a simple way to achieve a variety of common JavaScript tasks quickly and consistently across all major browsers and without any fallback code needed</li>
<li>It is simpler to access elements using jQuery's CSS-style selectors than it is using DOM queries (the selectors are more flexible and powerful)</li>
<li>jQuery's methods let you update the DOM tree, animate elements into and out of view, and loop through a set of elements, all in one line of code</li>
<li>jQuery includes methods that allow you to attach event listeners to selected elements without having to write any fallback code to support older browsers</li>
</ul>
</div>
</div>

<div id="outline-container-org555a4f4" class="outline-3">
<h3 id="org555a4f4">Section 7.2: What is jQuery?</h3>
<div class="outline-text-3" id="text-org555a4f4">
<ul class="org-ul">
<li>jQuery is a JS file that you include in your web pages</li>
<li>jQuery lets you find elements using CSS-style selectors and then do something with the elements using jQuery methods</li>
</ul>
</div>

<div id="outline-container-orgbc7622b" class="outline-4">
<h4 id="orgbc7622b">Section 7.2.1: Finding Elements using CSS-Style Selectors</h4>
<div class="outline-text-4" id="text-orgbc7622b">
<ul class="org-ul">
<li>A function called <code>jQuery()</code> lets you find one or more elements in the page</li>
<li>This function creates an object called <code>jQuery</code> which holds references to those elements</li>
<li><code>$()</code> is often as a shorthand to save typing <code>jQuery()</code></li>
<li>Example, let's say we have a link called "existing" and we run <code>jQuery("a.existing")</code> then it will return an object with the references to those elements</li>
<li>The <code>jQuery()</code> function has one parameter: a CSS-style selector</li>
<li><code>jQuery</code> selectors perform similar task to traditional DOM queries but syntax is much simpler because all you need to do is <code>$()</code></li>
<li>You can store the <code>jQuery</code> object in a variable, just like DOM nodes, and the <code>jQuery</code> object has methods and properties to manipulate the DOM nodes that you have selected just like DOM properties and methods</li>
</ul>
</div>
</div>

<div id="outline-container-org4b36b39" class="outline-4">
<h4 id="org4b36b39">Section 7.2.2: Do SOmething with Elements using jQuery Methods</h4>
<div class="outline-text-4" id="text-org4b36b39">
<ul class="org-ul">
<li><code>jQuery</code> object has many methods that you can use to work with the elements you select, these methods represent tasks that you commonly need to perform with elements</li>
<li>After using <code>jQuery()</code> the object and the elements it contains is referred to as a <b>matched set</b> or a <b>jQuery selection</b></li>
<li>You can then use the methods of the <code>jQuery</code> object to update the elements it contains</li>
<li>For example, the method <code>$().addClass()</code> adds a new value to the class attribute for all the elements selected (the matched set)</li>
<li>The differences from DOM is that jQuery is corss-browser and does not need to have fallback code</li>
<li>Thus selecting elements is simpler (also due to CSS-style syntax and the shorthand of the method <code>jQuery()</code>), add event handlers is also simple because it is cross-browser, methods affect all elements in the matched set without a need of the loop, additional methods are provided for animation, and once you have a set of elements you can apply multiple methods to it</li>
</ul>
</div>
</div>

<div id="outline-container-org7a2972a" class="outline-4">
<h4 id="org7a2972a">Section 7.2.3: A jQuery Example</h4>
<div class="outline-text-4" id="text-org7a2972a">
<ul class="org-ul">
<li>To use jQuery you need to include the jQuery script into your web page</li>
<li>Once jQuery is added you can then import your own JS file that would be using jQuery</li>
<li>Many people using jQuery use the minified file of jQuery so it ends with the extension <code>.min.js</code></li>
<li>This file went through a process called minification which involves unnecessary spaces, carriage returns, comments being stripped from the code, and optimizations to make the file smaller and faster to load (although minified files are hard to read)</li>
<li>You do not need to understand the jQuery code, all you need to know is how to select elements and use its methods and properties</li>
<li>Example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript">$(":header").addClass("headline");
$("li:lt(3)").hide().fadeIn(1500);
$("li").on("click", function(){ $(this).remove(); });
</pre>
</div>

<ul class="org-ul">
<li>The first line selects all of the <code>&lt;h1&gt; - &lt;h6&gt;</code> headings and adds a value of "headline" to their class attributes</li>
<li>The second line selects the first 3 list items and hides the elements, the reason why it hides them because if they are shown then how can they fade in, so after hiding them the elements are faded into view to give an animation of fading elements from unseen to seen</li>
<li>Notice the selector <code>:lt(3)</code>, this is a jQuery specific selector, it stands for "less than" and it uses a zero-based indexing, so it filters the selection to items with an index less than 3, so the first list item is index 0 and the next is index 2 and so on, so <code>lt(3)</code> wants to get only the list items that have an index "less than" 3</li>
<li>The last line of the code set an event listener on each <code>&lt;li&gt;</code> element and when the user clicks on one then it triggers an anonymous function</li>
<li>Inside this anonymous we can have <code>element.target</code> to get the target element or <code>this</code> (only if the event handler was added directly to the target element) so we use <code>this</code> with <code>$()</code> and whenever you give a DOM element to the function <code>jQuery()</code> or <code>$()</code> then you are basically wrapping the DOM element in a jQuery object giving you access to all of jQuery's powerful methods</li>
<li>So the last line of code, we add an event handler, inside the anonymous function we get the target element using <code>this</code>, we wrap it in a jQuery object, and then we finally call <code>remove()</code> on the object because this jQuery method removes the selected elements from the DOM completely along with all their child elements and associated data and event handlers</li>
<li>Thus the last line of code is basically adding an event listener so when a user clicks on a list item it triggers a function that removes the element from the page</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3448b2f" class="outline-3">
<h3 id="org3448b2f">Section 7.3: Why Use jQuery?</h3>
<div class="outline-text-3" id="text-org3448b2f">
<ul class="org-ul">
<li>jQuery does not do anything you cannot achieve with pure JS, it is a JS file at the end but it can make coding simpler</li>
<li>This is outdated but before selecting the elements you wanted was hard because older browsers did not support the lastest methods for selecting elements and IE did not treat whitespace as text nodes like the other browsers</li>
<li>This makes it hard to select the right elements across all major browsers so jQuery instead uses CSS selectors to select elements because CSS selectors are fast at selecting elements, are more accurate about which elements to select, require less code (compared to older DOM methods), and is already used by most front-end developers</li>
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4ea16c4" class="outline-2">
<h2 id="org4ea16c4">Keywords</h2>
<div class="outline-text-2" id="text-org4ea16c4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org581ad45" class="outline-2">
<h2 id="org581ad45">Questions</h2>
<div class="outline-text-2" id="text-org581ad45">
<ul class="org-ul">
<li><b>Q</b>: How is <code>$()</code> shorthand for <code>jQuery()</code>?
<ul class="org-ul">
<li><code>$()</code> works because <code>$</code> is an alias for <code>jQuery()</code></li>
<li>jQuery assigns its main function to <code>$</code> because <code>$</code> is a valid variable or function name</li>
<li>For example, somewhere in the code it does the following: <code>var $ = jQuery</code></li>
<li>Of course it doesn't use the parentheses because it is not invoking it just yet</li>
<li>Thus we do add the parentheses to <code>$</code> then you get <code>$()</code> and that is the function being invoked</li>
<li>So if you were to override <code>$</code> to a different value then <code>$()</code> would no longer work</li>
<li>In the end, <code>$</code> is a variable (alias) for the function called <code>jQuery</code></li>
</ul></li>

<li><b>Q</b>: Does the <code>$().on()</code> function accept anonymous functions and named functions?
<ul class="org-ul">
<li>Yes they accept anonymous functions and they also accepted named functions</li>
<li>Both anonymous functions and named functions also accept the event object inside the <code>on()</code> jQuery method</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org501c267" class="outline-2">
<h2 id="org501c267">Summary</h2>
</div>
</div>
</body>
</html>
